In [1]:
#manual data loading and converting to numpy array (slow)
import numpy as np
list1 = []
for line in open('datasets/data_2d.csv'):
    list1.append(list(map(float,line.split(','))))
arr1 = np.array(list1)
arr1.shape

(100, 3)

In [2]:
#using pandas to load csv file
import pandas as pd
data_frame = pd.read_csv('datasets/data_2d.csv',header=None)
type(data_frame)

pandas.core.frame.DataFrame

In [3]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
0    100 non-null float64
1    100 non-null float64
2    100 non-null float64
dtypes: float64(3)
memory usage: 2.4 KB

In [4]:
data_frame.head()

           0          1           2
0  17.930201  94.520592  320.259530
1  97.144697  69.593282  404.634472
2  81.775901   5.737648  181.485108
3  55.854342  70.325902  321.773638
4  49.366550  75.114040  322.465486

In [5]:
data_frame.head(2)

           0          1           2
0  17.930201  94.520592  320.259530
1  97.144697  69.593282  404.634472

In [6]:
data_frame.tail(2)

            0          1           2
98  41.693887  69.241126  284.834637
99   4.142669  52.254726  168.034401

In [7]:
data_frame.columns

Int64Index([0, 1, 2], dtype='int64')

In [8]:
#convert dataframe into numpy array
arr_2d = data_frame.as_matrix()
type(arr_2d)

numpy.ndarray

In [9]:
#returns column 0
data_frame[0].head()

0    17.930201
1    97.144697
2    81.775901
3    55.854342
4    49.366550
Name: 0, dtype: float64

In [10]:
#pandas series are 1d objects
#pandas dataframes are 2d objects
#arr_2d[0] != data_frame[0]
type(data_frame[0])

pandas.core.series.Series

In [11]:
#can select more than one columns
#to select 0 and 2nd column, pass in a list [0,2]
data_frame[[0,2]].head()

           0           2
0  17.930201  320.259530
1  97.144697  404.634472
2  81.775901  181.485108
3  55.854342  321.773638
4  49.366550  322.465486

In [12]:
#we can also select specific rows based on some criteria
#select rows where 0th column value is greater than 90
#boolean selection
data_frame[data_frame[0] > 90].head()

            0          1           2
1   97.144697  69.593282  404.634472
17  98.365746  82.697394  438.798964
35  95.368610  47.295507  336.126739
41  93.990404   0.127891  196.716167
43  98.998373  60.231266  384.381345

In [13]:
#print(data_frame[0] > 90)
type(data_frame[0] > 90)

pandas.core.series.Series

## Pandas Series and DataFrames

In [14]:
#pandas series
data = [10,20,30]
labels = ['a','b','c']
series1 = pd.Series(data,labels)
series1
#pd.Series({'a':10,'b':20}) can pass in dictionary as well

a    10
b    20
c    30
dtype: int64

In [15]:
series1['a']

10

In [16]:
series2 = pd.Series([1,2,3,4],['c','b','x','a'])
series2

c    1
b    2
x    3
a    4
dtype: int64

In [17]:
series1*series2

a    40.0
b    40.0
c    30.0
x     NaN
dtype: float64

In [18]:
from numpy.random import randn
dataframe1 = pd.DataFrame(data=randn(3,4),index=['a','b','c'],columns=['w','x','y','z'])
dataframe1
#each column is a pandas series

          w         x         y         z
a -0.573266  0.741846 -0.963482  0.684229
b  0.470682 -1.767635 -0.765815 -0.718580
c -1.548429  0.722514 -0.797053 -0.272265

In [19]:
#add new column based on some arithmetic
dataframe1['w+z'] = dataframe1['w'] + dataframe1['z']
dataframe1

          w         x         y         z       w+z
a -0.573266  0.741846 -0.963482  0.684229  0.110963
b  0.470682 -1.767635 -0.765815 -0.718580 -0.247898
c -1.548429  0.722514 -0.797053 -0.272265 -1.820694

In [20]:
#axis=0 refers to index 
#axis=1 refers to column
#drop column inplace
dataframe1.drop('w+z',axis=1,inplace=True)
dataframe1

          w         x         y         z
a -0.573266  0.741846 -0.963482  0.684229
b  0.470682 -1.767635 -0.765815 -0.718580
c -1.548429  0.722514 -0.797053 -0.272265

In [21]:
dataframe1.shape

(3, 4)

In [22]:
#drop row
dataframe1.drop('c')

          w         x         y         z
a -0.573266  0.741846 -0.963482  0.684229
b  0.470682 -1.767635 -0.765815 -0.718580

In [23]:
#selecting rows from labels based index location
#rows are also series in pandas
dataframe1.loc['a']

w   -0.573266
x    0.741846
y   -0.963482
z    0.684229
Name: a, dtype: float64

In [24]:
#selecting rows from integer based index location
dataframe1.iloc[0]

w   -0.573266
x    0.741846
y   -0.963482
z    0.684229
Name: a, dtype: float64

In [25]:
#another way of selecting row
dataframe1.ix[0]

w   -0.573266
x    0.741846
y   -0.963482
z    0.684229
Name: a, dtype: float64

In [26]:
dataframe1

          w         x         y         z
a -0.573266  0.741846 -0.963482  0.684229
b  0.470682 -1.767635 -0.765815 -0.718580
c -1.548429  0.722514 -0.797053 -0.272265

In [27]:
dataframe1.loc['a','w']

-0.5732657990958081

In [28]:
#selecting subsets
dataframe1.loc[['a','c'],['w','z']]

          w         z
a -0.573266  0.684229
c -1.548429 -0.272265

In [29]:
dataframe1 > 0

       w      x      y      z
a  False   True  False   True
b   True  False  False  False
c  False   True  False  False

In [30]:
#boolean or conditional selection
dataframe1[dataframe1 > 0]

          w         x   y         z
a       NaN  0.741846 NaN  0.684229
b  0.470682       NaN NaN       NaN
c       NaN  0.722514 NaN       NaN

In [31]:
dataframe1['x']>0

a     True
b    False
c     True
Name: x, dtype: bool

In [32]:
dataframe1[dataframe1['x']>0]

          w         x         y         z
a -0.573266  0.741846 -0.963482  0.684229
c -1.548429  0.722514 -0.797053 -0.272265

In [33]:
dataframe1[dataframe1['x']>0][['x','z']]

          x         z
a  0.741846  0.684229
c  0.722514 -0.272265

In [34]:
#multiple conditions using (& or |) operator
dataframe1[(dataframe1['x']>0) & (dataframe1['z']>1)]
#dataframe1[(dataframe1['x']>0) | (dataframe1['y']>1)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [35]:
#to reset index to integers
dataframe1.reset_index()
#dataframe1.reset_index(drop=True,inplace=True)

  index         w         x         y         z
0     a -0.573266  0.741846 -0.963482  0.684229
1     b  0.470682 -1.767635 -0.765815 -0.718580
2     c -1.548429  0.722514 -0.797053 -0.272265

In [36]:
#can also set any column as index using dataframe.set_index(col_name)
dataframe1['new_index'] = 'x1 y1 z1'.split()
dataframe1.set_index('new_index')

                  w         x         y         z
new_index
x1        -0.573266  0.741846 -0.963482  0.684229
y1         0.470682 -1.767635 -0.765815 -0.718580
z1        -1.548429  0.722514 -0.797053 -0.272265

### Multi-Index

In [37]:
tpl = list(zip(['X','X','X','Y','Y','Y'],[1,2,3,1,2,3]))
tpl

[('X', 1), ('X', 2), ('X', 3), ('Y', 1), ('Y', 2), ('Y', 3)]

In [38]:
#2-level index
hier_index = pd.MultiIndex.from_tuples(tpl)
hier_index

MultiIndex(levels=[['X', 'Y'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [39]:
df2 = pd.DataFrame(randn(6,3),index=hier_index,columns=['A','B','C'])
df2

            A         B         C
X 1 -1.974820 -1.084505  1.172055
  2  0.612502  1.746885  0.316834
  3 -1.349719  0.568568  0.250067
Y 1  0.078842 -0.419822 -0.403247
  2 -1.076563 -0.178947 -1.463766
  3  1.216021 -2.086871 -0.761674

In [40]:
df2.index.names

FrozenList([None, None])

In [41]:
df2.index.names = ['1st','2nd']
df2

                A         B         C
1st 2nd
X   1   -1.974820 -1.084505  1.172055
    2    0.612502  1.746885  0.316834
    3   -1.349719  0.568568  0.250067
Y   1    0.078842 -0.419822 -0.403247
    2   -1.076563 -0.178947 -1.463766
    3    1.216021 -2.086871 -0.761674

In [42]:
df2.loc['X']

            A         B         C
2nd
1   -1.974820 -1.084505  1.172055
2    0.612502  1.746885  0.316834
3   -1.349719  0.568568  0.250067

In [43]:
df2.loc['X'].loc[1]
#df2.loc['X'].loc[1]['C']

A   -1.974820
B   -1.084505
C    1.172055
Name: 1, dtype: float64

In [44]:
#cross section
df2.xs(3,level='2nd')

            A         B         C
1st
X   -1.349719  0.568568  0.250067
Y    1.216021 -2.086871 -0.761674

## Handling missing data

In [45]:
df3 = pd.DataFrame({'a':[1,2,np.nan], 'b':[4,np.nan,np.nan], 'c':[7,8,9]})

In [46]:
df3

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [47]:
#drop all rows having null values
df3.dropna()

     a    b  c
0  1.0  4.0  7

In [48]:
#drop all columns having null values
df3.dropna(axis=1)

   c
0  7
1  8
2  9

In [49]:
#droping all rows having 2 or more null values
df3.dropna(thresh=2)

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  8

In [50]:
#filling missing values
df3.fillna(value='fill')

      a     b  c
0     1     4  7
1     2  fill  8
2  fill  fill  9

In [51]:
#filling missing value of column 'a' with its mean
df3['a'].fillna(value=df3['a'].mean())
#df3['b'].fillna(value=df3['b'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

## Group By and aggregate functions

In [52]:
data = {"Company":['Google','Google','Facebook','Facebook','Microsoft','Microsoft'],
        "Developer":['Ahsan','Mehrab','Karan','Usman','Aayush','Shoaib'],
       "Salary":[1000000000,999999999,888888888,888888887,888888886,999999998]}

In [53]:
df = pd.DataFrame(data)
df

     Company Developer      Salary
0     Google     Ahsan  1000000000
1     Google    Mehrab   999999999
2   Facebook     Karan   888888888
3   Facebook     Usman   888888887
4  Microsoft    Aayush   888888886
5  Microsoft    Shoaib   999999998

In [54]:
df.groupby('Company').mean()

              Salary
Company
Facebook   888888887
Google     999999999
Microsoft  944444442

In [55]:
df.groupby('Company').max()['Salary']

Company
Facebook      888888888
Google       1000000000
Microsoft     999999998
Name: Salary, dtype: int64

In [56]:
df.groupby('Company').min().loc['Google','Salary']

999999999

In [57]:
#df.groupby('Company').describe().transpose()
df.groupby('Company').describe().T

Company Facebook                                                    \
           count         mean       std          min           25%
Salary       2.0  888888887.5  0.707107  888888887.0  8.888889e+08

Company                                         Google               \
                 50%           75%          max  count         mean
Salary   888888887.5  8.888889e+08  888888888.0    2.0  999999999.5

Company     ...                                  Microsoft               \
            ...                75%           max     count         mean
Salary      ...       1.000000e+09  1.000000e+09       2.0  944444442.0

Company                                                                    \
                  std          min          25%          50%          75%
Salary   7.856742e+07  888888886.0  916666664.0  944444442.0  972222220.0

Company
                 max
Salary   999999998.0

[1 rows x 24 columns]

## Merging, joining and concatenating

In [58]:
df1 = pd.DataFrame({'A':['a1','a2'],'B':['b1','b2'],'C':['c1','c2'],'D':['d1','d2']},index=[1,2])
df1

    A   B   C   D
1  a1  b1  c1  d1
2  a2  b2  c2  d2

In [59]:
df2 = pd.DataFrame({'A':['a3','a4'],'B':['b3','b4'],'C':['c3','c4'],'D':['d3','d4']},index=[3,4])
df2

    A   B   C   D
3  a3  b3  c3  d3
4  a4  b4  c4  d4

In [60]:
df3 = pd.DataFrame({'A':['a5','a6'],'B':['b5','b6'],'C':['c5','c6'],'D':['d5','d6']},index=[5,6])
df3

    A   B   C   D
5  a5  b5  c5  d5
6  a6  b6  c6  d6

In [61]:
#by default concat along axis=0
pd.concat([df1,df2,df3])

    A   B   C   D
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6

In [62]:
pd.concat([df1,df2,df3],axis=1)

     A    B    C    D    A    B    C    D    A    B    C    D
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a5   b5   c5   d5
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a6   b6   c6   d6

In [63]:
left = pd.DataFrame({'key1':['k0','k1','k2','k3'],
                     'A':['a0','a1','a2','a3'],
                     'B':['b0','b1','b3','b4']})
right = pd.DataFrame({'key1':['k1','k0','k3','k2'],
                     'C':['c0','c1','c2','c3'],
                     'D':['d0','d1','d3','d4']})

In [64]:
#inner join on key1 column
pd.merge(left,right,how='inner',on='key1')

    A   B key1   C   D
0  a0  b0   k0  c1  d1
1  a1  b1   k1  c0  d0
2  a2  b3   k2  c3  d4
3  a3  b4   k3  c2  d3

In [65]:
left.drop('key1',axis=1,inplace='true')
left['key2']=pd.Series(['k4','k5','k4','k5'])
left['key3']=pd.Series(['k5','k4','k4','k5'])
left

    A   B key2 key3
0  a0  b0   k4   k5
1  a1  b1   k5   k4
2  a2  b3   k4   k4
3  a3  b4   k5   k5

In [66]:
right.drop('key1',axis=1,inplace='true')
right['key2']=pd.Series(['k5','k4','k5','k5'])
right['key3']=pd.Series(['k5','k4','k4','k5'])
right

    C   D key2 key3
0  c0  d0   k5   k5
1  c1  d1   k4   k4
2  c2  d3   k5   k4
3  c3  d4   k5   k5

In [67]:
#by default inner join
pd.merge(left,right,on=['key2','key3'])

    A   B key2 key3   C   D
0  a1  b1   k5   k4  c2  d3
1  a2  b3   k4   k4  c1  d1
2  a3  b4   k5   k5  c0  d0
3  a3  b4   k5   k5  c3  d4

In [68]:
#outer join on 'key2,key3' column
pd.merge(left,right,how='outer',on=['key2','key3'])

    A   B key2 key3    C    D
0  a0  b0   k4   k5  NaN  NaN
1  a1  b1   k5   k4   c2   d3
2  a2  b3   k4   k4   c1   d1
3  a3  b4   k5   k5   c0   d0
4  a3  b4   k5   k5   c3   d4

In [69]:
#right inner join on 'key2,key3' column
pd.merge(left,right,how='right',on=['key2','key3'])

    A   B key2 key3   C   D
0  a1  b1   k5   k4  c2  d3
1  a2  b3   k4   k4  c1  d1
2  a3  b4   k5   k5  c0  d0
3  a3  b4   k5   k5  c3  d4

In [70]:
#left inner join on 'key2,key3' column
pd.merge(left,right,how='left',on=['key2','key3'])

    A   B key2 key3    C    D
0  a0  b0   k4   k5  NaN  NaN
1  a1  b1   k5   k4   c2   d3
2  a2  b3   k4   k4   c1   d1
3  a3  b4   k5   k5   c0   d0
4  a3  b4   k5   k5   c3   d4

In [71]:
#join is same as merge except one thing, it is done on index(rows) instead of columns.
left = pd.DataFrame({'A':['a0','a1','a2','a3'],
                     'B':['b0','b1','b3','b4']},
                       index=['k0','k1','k2','k3'])
right = pd.DataFrame({'C':['c0','c1','c2','c3'],
                     'D':['d0','d1','d3','d4']},
                    index=['k1','k0','k3','k0'],)
#by default left inner join
left.join(right)

     A   B    C    D
k0  a0  b0   c1   d1
k0  a0  b0   c3   d4
k1  a1  b1   c0   d0
k2  a2  b3  NaN  NaN
k3  a3  b4   c2   d3

In [72]:
#inner join
left.join(right,how='inner')

     A   B   C   D
k0  a0  b0  c1  d1
k0  a0  b0  c3  d4
k1  a1  b1  c0  d0
k3  a3  b4  c2  d3

## Some useful operations

In [73]:
df = pd.DataFrame({'col1':[1,2,3,4,5,np.nan],
                   'col2':[100,200,300,200,100,700],
                   'col3':['abc','efg','efz','alm','abc','abcd']})
df

   col1  col2  col3
0   1.0   100   abc
1   2.0   200   efg
2   3.0   300   efz
3   4.0   200   alm
4   5.0   100   abc
5   NaN   700  abcd

In [74]:
df.dtypes

col1    float64
col2      int64
col3     object
dtype: object

In [75]:
#finding unique values
df['col2'].unique()

array([100, 200, 300, 700])

In [76]:
#returns no of unique values
df['col2'].nunique()
#len(df['col2'].unique())

4

In [77]:
#returns occurence of each unique value in col2
df['col2'].value_counts()

100    2
200    2
700    1
300    1
Name: col2, dtype: int64

In [78]:
#returns indexes or column names
df.index
df.columns

#change column names
#df.columns = ['a','b','c']
#df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [79]:
#returns numpy representation of dataframe
df.values

array([[1.0, 100, 'abc'],
       [2.0, 200, 'efg'],
       [3.0, 300, 'efz'],
       [4.0, 200, 'alm'],
       [5.0, 100, 'abc'],
       [nan, 700, 'abcd']], dtype=object)

In [80]:
#transpose
df.T

        0    1    2    3    4     5
col1    1    2    3    4    5   NaN
col2  100  200  300  200  100   700
col3  abc  efg  efz  alm  abc  abcd

In [81]:
#slice
df[2:4]
# df[-2:]
# df[:]

   col1  col2 col3
2   3.0   300  efz
3   4.0   200  alm

In [82]:
df.loc[2:4,['col1','col3']]

   col1 col3
2   3.0  efz
3   4.0  alm
4   5.0  abc

In [83]:
df.loc[4,'col1']

5.0

In [84]:
#equivalent to above method but faster.
df.at[4,'col1']

5.0

In [85]:
#slicing by row and column positions
df.iloc[2:4,0:2]

   col1  col2
2   3.0   300
3   4.0   200

In [86]:
df.iloc[[2,5],[0,2]]

   col1  col3
2   3.0   efz
5   NaN  abcd

In [87]:
df.iloc[0,0]

1.0

In [88]:
#sorting by col2 values
df.sort_values(by='col2')

   col1  col2  col3
0   1.0   100   abc
4   5.0   100   abc
1   2.0   200   efg
3   4.0   200   alm
2   3.0   300   efz
5   NaN   700  abcd

In [89]:
#sorting by [col3,col2] values
df.sort_values(by=['col3','col2'])

   col1  col2  col3
0   1.0   100   abc
4   5.0   100   abc
5   NaN   700  abcd
3   4.0   200   alm
1   2.0   200   efg
2   3.0   300   efz

In [90]:
#sort by row index
df.sort_index(ascending=False)

   col1  col2  col3
5   NaN   700  abcd
4   5.0   100   abc
3   4.0   200   alm
2   3.0   300   efz
1   2.0   200   efg
0   1.0   100   abc

In [91]:
#finding null values (return dataframe of boolean values)
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5   True  False  False

In [92]:
#df.max()
#applying custom functions to dataframes
def square(n):
    return n**2
#square fn will be broadcasted and applied to each element of col2
df['col2'].apply(square)

0     10000
1     40000
2     90000
3     40000
4     10000
5    490000
Name: col2, dtype: int64

In [93]:
# applying lambda expressions
df['col1'].apply(lambda x:x**2)

0     1.0
1     4.0
2     9.0
3    16.0
4    25.0
5     NaN
Name: col1, dtype: float64

In [94]:
#can also apply built-in functions
df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    4
Name: col3, dtype: int64

In [95]:
# creating pivot tables
df = pd.DataFrame({'A':['ab','cd','cd','ab','ab','ab'],
                   'B':['one','two','one','two','one','two'],
                   'C':['x','x','x','y','y','y'],
                   'D':[1,2,3,4,5,6]})
df

    A    B  C  D
0  ab  one  x  1
1  cd  two  x  2
2  cd  one  x  3
3  ab  two  y  4
4  ab  one  y  5
5  ab  two  y  6

In [96]:
# 2-level index
df.pivot_table(values='D',index=['A','B'],columns='C')

C         x    y
A  B
ab one  1.0  5.0
   two  NaN  5.0
cd one  3.0  NaN
   two  2.0  NaN

## Input and Output

In [97]:
#saving df in csv file
df.to_csv('datasets/csv_file1.csv',index=False)

In [98]:
df = pd.read_csv('datasets/csv_file1.csv')
df

    A    B  C  D
0  ab  one  x  1
1  cd  two  x  2
2  cd  one  x  3
3  ab  two  y  4
4  ab  one  y  5
5  ab  two  y  6

In [99]:
#saving df in excel file
#conda install xlrd
df.to_excel('datasets/excelfile.xlsx',sheet_name='sheet1')

In [100]:
df = pd.read_excel('datasets/excelfile.xlsx',sheetname='sheet1')
df

    A    B  C  D
0  ab  one  x  1
1  cd  two  x  2
2  cd  one  x  3
3  ab  two  y  4
4  ab  one  y  5
5  ab  two  y  6

### Ref: http://pandas.pydata.org/pandas-docs/stable/10min.html